# ExportFontInfo Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportFontInfo Constructor
ExportFontInfo Class See Also
---
Constructs a new default ExportFontInfo.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExportFontInfo()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ExportFontInfo()
```

# See Also
ExportFontInfo Class
ExportFontInfo Overload
Autodesk.Revit.DB Namespace